Examples/CHT/flow-over-plate/buoyantPimpleFoam-laplacianFoam/Fluid/system/preciceDict.sink
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (interface);
    
    readData
    (
        Sink-Temperature-Solid
        Heat-Transfer-Coefficient-Solid
    );
    
    writeData
    (
        Sink-Temperature-Fluid
        Heat-Transfer-Coefficient-Fluid
    );
  };
};